Revit 2027 API
Wall.CanHaveProfileSketch Method
 Checks whether this wall has or can have a profile sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanHaveProfileSketch()
Public Function CanHaveProfileSketch As Boolean
public:
bool CanHaveProfileSketch()
member CanHaveProfileSketch : unit -> bool
Return Value
Boolean
 True if wall supports profile sketch, false otherwise.
Remarks
 Wall does not support profile if it is not a straight wall; or wall is tapered; or it is an old curtain wall; or it is an infill wall; or it is a replacement curtain panel.
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace